In [1]:
import pandas as pd

In [6]:
df = pd.read_excel(r'C:\Users\Connie Wu\Desktop\Log\Log- 2021-05-27.xlsx',sheet_name = 'LOG')

In [7]:
df

,Admin,Ver.,Partial,Date,INT/US,Order Type,Order Qty
0,demon,Ver.05.17,NaN,2019-05-17 11:13:13,INT ORDERS,Bimake,1.0
1,demon,Ver.05.17,NaN,2019-05-17 13:03:09,US ORDERS,Selleck,17.0
2,demon,Ver.05.17,NaN,2019-05-17 15:23:36,US ORDERS,Selleck,39.0
3,demon,Ver.05.17,NaN,2019-05-17 15:30:52,INT ORDERS,Selleck,1.0
4,demon,Ver.05.17,NaN,2019-05-20 09:38:36,US ORDERS,Selleck,32.0
...,...,...,...,...,...,...,...
4751,alice,Ver.01.21,NaN,2021-05-27 09:07:17,US ORDERS,Selleck,41.0
4752,alice,Ver.01.21,NaN,2021-05-27 09:21:23,INT ORDERS,Selleck,1.0
4753,alice,Ver.01.21,NaN,2021-05-27 09:35:16,INT ORDERS,Selleck,2.0
4754,alice,Ver.01.21,NaN,2021-05-27 10:28:37,US ORDERS,Bimake,1.0
4755,alice,Ver.01.21,NaN,2021-05-27 10:48:35,INT ORDERS,Selleck,1.0

In [8]:
# the useful information were on the columns of 'Date', 'INT/US','Order Type','Order Qty', so subset the columns mentioned. 

df = df[['Date', 'INT/US','Order Type','Order Qty']]
df.head()

                 Date      INT/US Order Type  Order Qty
0 2019-05-17 11:13:13  INT ORDERS     Bimake        1.0
1 2019-05-17 13:03:09   US ORDERS    Selleck       17.0
2 2019-05-17 15:23:36   US ORDERS    Selleck       39.0
3 2019-05-17 15:30:52  INT ORDERS    Selleck        1.0
4 2019-05-20 09:38:36   US ORDERS    Selleck       32.0